RohithSai4518/Embeded_Systems/include/registers/reg_avr_atmega328p.h
/**
 * @file reg_avr_atmega328p.h
 * @brief Microchip / Atmel AVR ATmega328P & ATmega2560 Complete I/O Registers
 * @copyright Clean-room proprietary implementation. Zero GPL/Apache code.
 */

#ifndef REG_AVR_ATMEGA328P_H
#define REG_AVR_ATMEGA328P_H

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/* AVR Hardware I/O Register 0x01 */
#define AVR_IO_REG_ADDR_001  (*(volatile uint8_t *)(0x20 + 1))
#define AVR_IO_REG_001_BIT_0 (0)
#define AVR_IO_REG_001_BIT_1 (1)
#define AVR_IO_REG_001_BIT_2 (2)
#define AVR_IO_REG_001_BIT_3 (3)
#define AVR_IO_REG_001_BIT_4 (4)
#define AVR_IO_REG_001_BIT_5 (5)
#define AVR_IO_REG_001_BIT_6 (6)
#define AVR_IO_REG_001_BIT_7 (7)

/* AVR Hardware I/O Register 0x02 */
#define AVR_IO_REG_ADDR_002  (*(volatile uint8_t *)(0x20 + 2))
#define AVR_IO_REG_002_BIT_0 (0)
#define AVR_IO_REG_002_BIT_1 (1)
#define AVR_IO_REG_002_BIT_2 (2)
#define AVR_IO_REG_002_BIT_3 (3)
#define AVR_IO_REG_002_BIT_4 (4)
#define AVR_IO_REG_002_BIT_5 (5)
#define AVR_IO_REG_002_BIT_6 (6)
#define AVR_IO_REG_002_BIT_7 (7)

/* AVR Hardware I/O Register 0x03 */
#define AVR_IO_REG_ADDR_003  (*(volatile uint8_t *)(0x20 + 3))
#define AVR_IO_REG_003_BIT_0 (0)
#define AVR_IO_REG_003_BIT_1 (1)
#define AVR_IO_REG_003_BIT_2 (2)
#define AVR_IO_REG_003_BIT_3 (3)
#define AVR_IO_REG_003_BIT_4 (4)
#define AVR_IO_REG_003_BIT_5 (5)
#define AVR_IO_REG_003_BIT_6 (6)
#define AVR_IO_REG_003_BIT_7 (7)

/* AVR Hardware I/O Register 0x04 */
#define AVR_IO_REG_ADDR_004  (*(volatile uint8_t *)(0x20 + 4))
#define AVR_IO_REG_004_BIT_0 (0)
#define AVR_IO_REG_004_BIT_1 (1)
#define AVR_IO_REG_004_BIT_2 (2)
#define AVR_IO_REG_004_BIT_3 (3)
#define AVR_IO_REG_004_BIT_4 (4)
#define AVR_IO_REG_004_BIT_5 (5)
#define AVR_IO_REG_004_BIT_6 (6)
#define AVR_IO_REG_004_BIT_7 (7)

/* AVR Hardware I/O Register 0x05 */
#define AVR_IO_REG_ADDR_005  (*(volatile uint8_t *)(0x20 + 5))
#define AVR_IO_REG_005_BIT_0 (0)
#define AVR_IO_REG_005_BIT_1 (1)
#define AVR_IO_REG_005_BIT_2 (2)
#define AVR_IO_REG_005_BIT_3 (3)
#define AVR_IO_REG_005_BIT_4 (4)
#define AVR_IO_REG_005_BIT_5 (5)
#define AVR_IO_REG_005_BIT_6 (6)
#define AVR_IO_REG_005_BIT_7 (7)

/* AVR Hardware I/O Register 0x06 */
#define AVR_IO_REG_ADDR_006  (*(volatile uint8_t *)(0x20 + 6))
#define AVR_IO_REG_006_BIT_0 (0)
#define AVR_IO_REG_006_BIT_1 (1)
#define AVR_IO_REG_006_BIT_2 (2)
#define AVR_IO_REG_006_BIT_3 (3)
#define AVR_IO_REG_006_BIT_4 (4)
#define AVR_IO_REG_006_BIT_5 (5)
#define AVR_IO_REG_006_BIT_6 (6)
#define AVR_IO_REG_006_BIT_7 (7)

/* AVR Hardware I/O Register 0x07 */
#define AVR_IO_REG_ADDR_007  (*(volatile uint8_t *)(0x20 + 7))
#define AVR_IO_REG_007_BIT_0 (0)
#define AVR_IO_REG_007_BIT_1 (1)
#define AVR_IO_REG_007_BIT_2 (2)
#define AVR_IO_REG_007_BIT_3 (3)
#define AVR_IO_REG_007_BIT_4 (4)
#define AVR_IO_REG_007_BIT_5 (5)
#define AVR_IO_REG_007_BIT_6 (6)
#define AVR_IO_REG_007_BIT_7 (7)

/* AVR Hardware I/O Register 0x08 */
#define AVR_IO_REG_ADDR_008  (*(volatile uint8_t *)(0x20 + 8))
#define AVR_IO_REG_008_BIT_0 (0)
#define AVR_IO_REG_008_BIT_1 (1)
#define AVR_IO_REG_008_BIT_2 (2)
#define AVR_IO_REG_008_BIT_3 (3)
#define AVR_IO_REG_008_BIT_4 (4)
#define AVR_IO_REG_008_BIT_5 (5)
#define AVR_IO_REG_008_BIT_6 (6)
#define AVR_IO_REG_008_BIT_7 (7)

/* AVR Hardware I/O Register 0x09 */
#define AVR_IO_REG_ADDR_009  (*(volatile uint8_t *)(0x20 + 9))
#define AVR_IO_REG_009_BIT_0 (0)
#define AVR_IO_REG_009_BIT_1 (1)
#define AVR_IO_REG_009_BIT_2 (2)
#define AVR_IO_REG_009_BIT_3 (3)
#define AVR_IO_REG_009_BIT_4 (4)
#define AVR_IO_REG_009_BIT_5 (5)
#define AVR_IO_REG_009_BIT_6 (6)
#define AVR_IO_REG_009_BIT_7 (7)

/* AVR Hardware I/O Register 0x0A */
#define AVR_IO_REG_ADDR_010  (*(volatile uint8_t *)(0x20 + 10))
#define AVR_IO_REG_010_BIT_0 (0)
#define AVR_IO_REG_010_BIT_1 (1)
#define AVR_IO_REG_010_BIT_2 (2)
#define AVR_IO_REG_010_BIT_3 (3)
#define AVR_IO_REG_010_BIT_4 (4)
#define AVR_IO_REG_010_BIT_5 (5)
#define AVR_IO_REG_010_BIT_6 (6)
#define AVR_IO_REG_010_BIT_7 (7)

/* AVR Hardware I/O Register 0x0B */
#define AVR_IO_REG_ADDR_011  (*(volatile uint8_t *)(0x20 + 11))
#define AVR_IO_REG_011_BIT_0 (0)
#define AVR_IO_REG_011_BIT_1 (1)
#define AVR_IO_REG_011_BIT_2 (2)
#define AVR_IO_REG_011_BIT_3 (3)
#define AVR_IO_REG_011_BIT_4 (4)
#define AVR_IO_REG_011_BIT_5 (5)
#define AVR_IO_REG_011_BIT_6 (6)
#define AVR_IO_REG_011_BIT_7 (7)

/* AVR Hardware I/O Register 0x0C */
#define AVR_IO_REG_ADDR_012  (*(volatile uint8_t *)(0x20 + 12))
#define AVR_IO_REG_012_BIT_0 (0)
#define AVR_IO_REG_012_BIT_1 (1)
#define AVR_IO_REG_012_BIT_2 (2)
#define AVR_IO_REG_012_BIT_3 (3)
#define AVR_IO_REG_012_BIT_4 (4)
#define AVR_IO_REG_012_BIT_5 (5)
#define AVR_IO_REG_012_BIT_6 (6)
#define AVR_IO_REG_012_BIT_7 (7)

/* AVR Hardware I/O Register 0x0D */
#define AVR_IO_REG_ADDR_013  (*(volatile uint8_t *)(0x20 + 13))
#define AVR_IO_REG_013_BIT_0 (0)
#define AVR_IO_REG_013_BIT_1 (1)
#define AVR_IO_REG_013_BIT_2 (2)
#define AVR_IO_REG_013_BIT_3 (3)
#define AVR_IO_REG_013_BIT_4 (4)
#define AVR_IO_REG_013_BIT_5 (5)
#define AVR_IO_REG_013_BIT_6 (6)
#define AVR_IO_REG_013_BIT_7 (7)

/* AVR Hardware I/O Register 0x0E */
#define AVR_IO_REG_ADDR_014  (*(volatile uint8_t *)(0x20 + 14))
#define AVR_IO_REG_014_BIT_0 (0)
#define AVR_IO_REG_014_BIT_1 (1)
#define AVR_IO_REG_014_BIT_2 (2)
#define AVR_IO_REG_014_BIT_3 (3)
#define AVR_IO_REG_014_BIT_4 (4)
#define AVR_IO_REG_014_BIT_5 (5)
#define AVR_IO_REG_014_BIT_6 (6)
#define AVR_IO_REG_014_BIT_7 (7)

/* AVR Hardware I/O Register 0x0F */
#define AVR_IO_REG_ADDR_015  (*(volatile uint8_t *)(0x20 + 15))
#define AVR_IO_REG_015_BIT_0 (0)
#define AVR_IO_REG_015_BIT_1 (1)
#define AVR_IO_REG_015_BIT_2 (2)
#define AVR_IO_REG_015_BIT_3 (3)
#define AVR_IO_REG_015_BIT_4 (4)
#define AVR_IO_REG_015_BIT_5 (5)
#define AVR_IO_REG_015_BIT_6 (6)
#define AVR_IO_REG_015_BIT_7 (7)

/* AVR Hardware I/O Register 0x10 */
#define AVR_IO_REG_ADDR_016  (*(volatile uint8_t *)(0x20 + 16))
#define AVR_IO_REG_016_BIT_0 (0)
#define AVR_IO_REG_016_BIT_1 (1)
#define AVR_IO_REG_016_BIT_2 (2)
#define AVR_IO_REG_016_BIT_3 (3)
#define AVR_IO_REG_016_BIT_4 (4)
#define AVR_IO_REG_016_BIT_5 (5)
#define AVR_IO_REG_016_BIT_6 (6)
#define AVR_IO_REG_016_BIT_7 (7)

/* AVR Hardware I/O Register 0x11 */
#define AVR_IO_REG_ADDR_017  (*(volatile uint8_t *)(0x20 + 17))
#define AVR_IO_REG_017_BIT_0 (0)
#define AVR_IO_REG_017_BIT_1 (1)
#define AVR_IO_REG_017_BIT_2 (2)
#define AVR_IO_REG_017_BIT_3 (3)
#define AVR_IO_REG_017_BIT_4 (4)
#define AVR_IO_REG_017_BIT_5 (5)
#define AVR_IO_REG_017_BIT_6 (6)
#define AVR_IO_REG_017_BIT_7 (7)

/* AVR Hardware I/O Register 0x12 */
#define AVR_IO_REG_ADDR_018  (*(volatile uint8_t *)(0x20 + 18))
#define AVR_IO_REG_018_BIT_0 (0)
#define AVR_IO_REG_018_BIT_1 (1)
#define AVR_IO_REG_018_BIT_2 (2)
#define AVR_IO_REG_018_BIT_3 (3)
#define AVR_IO_REG_018_BIT_4 (4)
#define AVR_IO_REG_018_BIT_5 (5)
#define AVR_IO_REG_018_BIT_6 (6)
#define AVR_IO_REG_018_BIT_7 (7)

/* AVR Hardware I/O Register 0x13 */
#define AVR_IO_REG_ADDR_019  (*(volatile uint8_t *)(0x20 + 19))
#define AVR_IO_REG_019_BIT_0 (0)
#define AVR_IO_REG_019_BIT_1 (1)
#define AVR_IO_REG_019_BIT_2 (2)
#define AVR_IO_REG_019_BIT_3 (3)
#define AVR_IO_REG_019_BIT_4 (4)
#define AVR_IO_REG_019_BIT_5 (5)
#define AVR_IO_REG_019_BIT_6 (6)
#define AVR_IO_REG_019_BIT_7 (7)

/* AVR Hardware I/O Register 0x14 */
#define AVR_IO_REG_ADDR_020  (*(volatile uint8_t *)(0x20 + 20))
#define AVR_IO_REG_020_BIT_0 (0)
#define AVR_IO_REG_020_BIT_1 (1)
#define AVR_IO_REG_020_BIT_2 (2)
#define AVR_IO_REG_020_BIT_3 (3)
#define AVR_IO_REG_020_BIT_4 (4)
#define AVR_IO_REG_020_BIT_5 (5)
#define AVR_IO_REG_020_BIT_6 (6)
#define AVR_IO_REG_020_BIT_7 (7)

/* AVR Hardware I/O Register 0x15 */
#define AVR_IO_REG_ADDR_021  (*(volatile uint8_t *)(0x20 + 21))
#define AVR_IO_REG_021_BIT_0 (0)
#define AVR_IO_REG_021_BIT_1 (1)
#define AVR_IO_REG_021_BIT_2 (2)
#define AVR_IO_REG_021_BIT_3 (3)
#define AVR_IO_REG_021_BIT_4 (4)
#define AVR_IO_REG_021_BIT_5 (5)
#define AVR_IO_REG_021_BIT_6 (6)
#define AVR_IO_REG_021_BIT_7 (7)

