RohithSai4518/Embeded_Systems/include/registers/reg_avr_atmega328p.h
/* AVR Hardware I/O Register 0x16 */
#define AVR_IO_REG_ADDR_022  (*(volatile uint8_t *)(0x20 + 22))
#define AVR_IO_REG_022_BIT_0 (0)
#define AVR_IO_REG_022_BIT_1 (1)
#define AVR_IO_REG_022_BIT_2 (2)
#define AVR_IO_REG_022_BIT_3 (3)
#define AVR_IO_REG_022_BIT_4 (4)
#define AVR_IO_REG_022_BIT_5 (5)
#define AVR_IO_REG_022_BIT_6 (6)
#define AVR_IO_REG_022_BIT_7 (7)

/* AVR Hardware I/O Register 0x17 */
#define AVR_IO_REG_ADDR_023  (*(volatile uint8_t *)(0x20 + 23))
#define AVR_IO_REG_023_BIT_0 (0)
#define AVR_IO_REG_023_BIT_1 (1)
#define AVR_IO_REG_023_BIT_2 (2)
#define AVR_IO_REG_023_BIT_3 (3)
#define AVR_IO_REG_023_BIT_4 (4)
#define AVR_IO_REG_023_BIT_5 (5)
#define AVR_IO_REG_023_BIT_6 (6)
#define AVR_IO_REG_023_BIT_7 (7)

/* AVR Hardware I/O Register 0x18 */
#define AVR_IO_REG_ADDR_024  (*(volatile uint8_t *)(0x20 + 24))
#define AVR_IO_REG_024_BIT_0 (0)
#define AVR_IO_REG_024_BIT_1 (1)
#define AVR_IO_REG_024_BIT_2 (2)
#define AVR_IO_REG_024_BIT_3 (3)
#define AVR_IO_REG_024_BIT_4 (4)
#define AVR_IO_REG_024_BIT_5 (5)
#define AVR_IO_REG_024_BIT_6 (6)
#define AVR_IO_REG_024_BIT_7 (7)

/* AVR Hardware I/O Register 0x19 */
#define AVR_IO_REG_ADDR_025  (*(volatile uint8_t *)(0x20 + 25))
#define AVR_IO_REG_025_BIT_0 (0)
#define AVR_IO_REG_025_BIT_1 (1)
#define AVR_IO_REG_025_BIT_2 (2)
#define AVR_IO_REG_025_BIT_3 (3)
#define AVR_IO_REG_025_BIT_4 (4)
#define AVR_IO_REG_025_BIT_5 (5)
#define AVR_IO_REG_025_BIT_6 (6)
#define AVR_IO_REG_025_BIT_7 (7)

/* AVR Hardware I/O Register 0x1A */
#define AVR_IO_REG_ADDR_026  (*(volatile uint8_t *)(0x20 + 26))
#define AVR_IO_REG_026_BIT_0 (0)
#define AVR_IO_REG_026_BIT_1 (1)
#define AVR_IO_REG_026_BIT_2 (2)
#define AVR_IO_REG_026_BIT_3 (3)
#define AVR_IO_REG_026_BIT_4 (4)
#define AVR_IO_REG_026_BIT_5 (5)
#define AVR_IO_REG_026_BIT_6 (6)
#define AVR_IO_REG_026_BIT_7 (7)

/* AVR Hardware I/O Register 0x1B */
#define AVR_IO_REG_ADDR_027  (*(volatile uint8_t *)(0x20 + 27))
#define AVR_IO_REG_027_BIT_0 (0)
#define AVR_IO_REG_027_BIT_1 (1)
#define AVR_IO_REG_027_BIT_2 (2)
#define AVR_IO_REG_027_BIT_3 (3)
#define AVR_IO_REG_027_BIT_4 (4)
#define AVR_IO_REG_027_BIT_5 (5)
#define AVR_IO_REG_027_BIT_6 (6)
#define AVR_IO_REG_027_BIT_7 (7)

/* AVR Hardware I/O Register 0x1C */
#define AVR_IO_REG_ADDR_028  (*(volatile uint8_t *)(0x20 + 28))
#define AVR_IO_REG_028_BIT_0 (0)
#define AVR_IO_REG_028_BIT_1 (1)
#define AVR_IO_REG_028_BIT_2 (2)
#define AVR_IO_REG_028_BIT_3 (3)
#define AVR_IO_REG_028_BIT_4 (4)
#define AVR_IO_REG_028_BIT_5 (5)
#define AVR_IO_REG_028_BIT_6 (6)
#define AVR_IO_REG_028_BIT_7 (7)

/* AVR Hardware I/O Register 0x1D */
#define AVR_IO_REG_ADDR_029  (*(volatile uint8_t *)(0x20 + 29))
#define AVR_IO_REG_029_BIT_0 (0)
#define AVR_IO_REG_029_BIT_1 (1)
#define AVR_IO_REG_029_BIT_2 (2)
#define AVR_IO_REG_029_BIT_3 (3)
#define AVR_IO_REG_029_BIT_4 (4)
#define AVR_IO_REG_029_BIT_5 (5)
#define AVR_IO_REG_029_BIT_6 (6)
#define AVR_IO_REG_029_BIT_7 (7)

/* AVR Hardware I/O Register 0x1E */
#define AVR_IO_REG_ADDR_030  (*(volatile uint8_t *)(0x20 + 30))
#define AVR_IO_REG_030_BIT_0 (0)
#define AVR_IO_REG_030_BIT_1 (1)
#define AVR_IO_REG_030_BIT_2 (2)
#define AVR_IO_REG_030_BIT_3 (3)
#define AVR_IO_REG_030_BIT_4 (4)
#define AVR_IO_REG_030_BIT_5 (5)
#define AVR_IO_REG_030_BIT_6 (6)
#define AVR_IO_REG_030_BIT_7 (7)

/* AVR Hardware I/O Register 0x1F */
#define AVR_IO_REG_ADDR_031  (*(volatile uint8_t *)(0x20 + 31))
#define AVR_IO_REG_031_BIT_0 (0)
#define AVR_IO_REG_031_BIT_1 (1)
#define AVR_IO_REG_031_BIT_2 (2)
#define AVR_IO_REG_031_BIT_3 (3)
#define AVR_IO_REG_031_BIT_4 (4)
#define AVR_IO_REG_031_BIT_5 (5)
#define AVR_IO_REG_031_BIT_6 (6)
#define AVR_IO_REG_031_BIT_7 (7)

/* AVR Hardware I/O Register 0x20 */
#define AVR_IO_REG_ADDR_032  (*(volatile uint8_t *)(0x20 + 32))
#define AVR_IO_REG_032_BIT_0 (0)
#define AVR_IO_REG_032_BIT_1 (1)
#define AVR_IO_REG_032_BIT_2 (2)
#define AVR_IO_REG_032_BIT_3 (3)
#define AVR_IO_REG_032_BIT_4 (4)
#define AVR_IO_REG_032_BIT_5 (5)
#define AVR_IO_REG_032_BIT_6 (6)
#define AVR_IO_REG_032_BIT_7 (7)

/* AVR Hardware I/O Register 0x21 */
#define AVR_IO_REG_ADDR_033  (*(volatile uint8_t *)(0x20 + 33))
#define AVR_IO_REG_033_BIT_0 (0)
#define AVR_IO_REG_033_BIT_1 (1)
#define AVR_IO_REG_033_BIT_2 (2)
#define AVR_IO_REG_033_BIT_3 (3)
#define AVR_IO_REG_033_BIT_4 (4)
#define AVR_IO_REG_033_BIT_5 (5)
#define AVR_IO_REG_033_BIT_6 (6)
#define AVR_IO_REG_033_BIT_7 (7)

/* AVR Hardware I/O Register 0x22 */
#define AVR_IO_REG_ADDR_034  (*(volatile uint8_t *)(0x20 + 34))
#define AVR_IO_REG_034_BIT_0 (0)
#define AVR_IO_REG_034_BIT_1 (1)
#define AVR_IO_REG_034_BIT_2 (2)
#define AVR_IO_REG_034_BIT_3 (3)
#define AVR_IO_REG_034_BIT_4 (4)
#define AVR_IO_REG_034_BIT_5 (5)
#define AVR_IO_REG_034_BIT_6 (6)
#define AVR_IO_REG_034_BIT_7 (7)

/* AVR Hardware I/O Register 0x23 */
#define AVR_IO_REG_ADDR_035  (*(volatile uint8_t *)(0x20 + 35))
#define AVR_IO_REG_035_BIT_0 (0)
#define AVR_IO_REG_035_BIT_1 (1)
#define AVR_IO_REG_035_BIT_2 (2)
#define AVR_IO_REG_035_BIT_3 (3)
#define AVR_IO_REG_035_BIT_4 (4)
#define AVR_IO_REG_035_BIT_5 (5)
#define AVR_IO_REG_035_BIT_6 (6)
#define AVR_IO_REG_035_BIT_7 (7)

/* AVR Hardware I/O Register 0x24 */
#define AVR_IO_REG_ADDR_036  (*(volatile uint8_t *)(0x20 + 36))
#define AVR_IO_REG_036_BIT_0 (0)
#define AVR_IO_REG_036_BIT_1 (1)
#define AVR_IO_REG_036_BIT_2 (2)
#define AVR_IO_REG_036_BIT_3 (3)
#define AVR_IO_REG_036_BIT_4 (4)
#define AVR_IO_REG_036_BIT_5 (5)
#define AVR_IO_REG_036_BIT_6 (6)
#define AVR_IO_REG_036_BIT_7 (7)

/* AVR Hardware I/O Register 0x25 */
#define AVR_IO_REG_ADDR_037  (*(volatile uint8_t *)(0x20 + 37))
#define AVR_IO_REG_037_BIT_0 (0)
#define AVR_IO_REG_037_BIT_1 (1)
#define AVR_IO_REG_037_BIT_2 (2)
#define AVR_IO_REG_037_BIT_3 (3)
#define AVR_IO_REG_037_BIT_4 (4)
#define AVR_IO_REG_037_BIT_5 (5)
#define AVR_IO_REG_037_BIT_6 (6)
#define AVR_IO_REG_037_BIT_7 (7)

/* AVR Hardware I/O Register 0x26 */
#define AVR_IO_REG_ADDR_038  (*(volatile uint8_t *)(0x20 + 38))
#define AVR_IO_REG_038_BIT_0 (0)
#define AVR_IO_REG_038_BIT_1 (1)
#define AVR_IO_REG_038_BIT_2 (2)
#define AVR_IO_REG_038_BIT_3 (3)
#define AVR_IO_REG_038_BIT_4 (4)
#define AVR_IO_REG_038_BIT_5 (5)
#define AVR_IO_REG_038_BIT_6 (6)
#define AVR_IO_REG_038_BIT_7 (7)

/* AVR Hardware I/O Register 0x27 */
#define AVR_IO_REG_ADDR_039  (*(volatile uint8_t *)(0x20 + 39))
#define AVR_IO_REG_039_BIT_0 (0)
#define AVR_IO_REG_039_BIT_1 (1)
#define AVR_IO_REG_039_BIT_2 (2)
#define AVR_IO_REG_039_BIT_3 (3)
#define AVR_IO_REG_039_BIT_4 (4)
#define AVR_IO_REG_039_BIT_5 (5)
#define AVR_IO_REG_039_BIT_6 (6)
#define AVR_IO_REG_039_BIT_7 (7)

/* AVR Hardware I/O Register 0x28 */
#define AVR_IO_REG_ADDR_040  (*(volatile uint8_t *)(0x20 + 40))
#define AVR_IO_REG_040_BIT_0 (0)
#define AVR_IO_REG_040_BIT_1 (1)
#define AVR_IO_REG_040_BIT_2 (2)
#define AVR_IO_REG_040_BIT_3 (3)
#define AVR_IO_REG_040_BIT_4 (4)
#define AVR_IO_REG_040_BIT_5 (5)
#define AVR_IO_REG_040_BIT_6 (6)
#define AVR_IO_REG_040_BIT_7 (7)

/* AVR Hardware I/O Register 0x29 */
#define AVR_IO_REG_ADDR_041  (*(volatile uint8_t *)(0x20 + 41))
#define AVR_IO_REG_041_BIT_0 (0)
#define AVR_IO_REG_041_BIT_1 (1)
#define AVR_IO_REG_041_BIT_2 (2)
#define AVR_IO_REG_041_BIT_3 (3)
#define AVR_IO_REG_041_BIT_4 (4)
#define AVR_IO_REG_041_BIT_5 (5)
#define AVR_IO_REG_041_BIT_6 (6)
#define AVR_IO_REG_041_BIT_7 (7)

/* AVR Hardware I/O Register 0x2A */
#define AVR_IO_REG_ADDR_042  (*(volatile uint8_t *)(0x20 + 42))
#define AVR_IO_REG_042_BIT_0 (0)
#define AVR_IO_REG_042_BIT_1 (1)
#define AVR_IO_REG_042_BIT_2 (2)
#define AVR_IO_REG_042_BIT_3 (3)
#define AVR_IO_REG_042_BIT_4 (4)
#define AVR_IO_REG_042_BIT_5 (5)
#define AVR_IO_REG_042_BIT_6 (6)
#define AVR_IO_REG_042_BIT_7 (7)

/* AVR Hardware I/O Register 0x2B */
#define AVR_IO_REG_ADDR_043  (*(volatile uint8_t *)(0x20 + 43))
#define AVR_IO_REG_043_BIT_0 (0)
#define AVR_IO_REG_043_BIT_1 (1)
#define AVR_IO_REG_043_BIT_2 (2)
#define AVR_IO_REG_043_BIT_3 (3)
#define AVR_IO_REG_043_BIT_4 (4)
#define AVR_IO_REG_043_BIT_5 (5)
#define AVR_IO_REG_043_BIT_6 (6)
#define AVR_IO_REG_043_BIT_7 (7)

/* AVR Hardware I/O Register 0x2C */
#define AVR_IO_REG_ADDR_044  (*(volatile uint8_t *)(0x20 + 44))
#define AVR_IO_REG_044_BIT_0 (0)
#define AVR_IO_REG_044_BIT_1 (1)
#define AVR_IO_REG_044_BIT_2 (2)
#define AVR_IO_REG_044_BIT_3 (3)
#define AVR_IO_REG_044_BIT_4 (4)
#define AVR_IO_REG_044_BIT_5 (5)
#define AVR_IO_REG_044_BIT_6 (6)
#define AVR_IO_REG_044_BIT_7 (7)

/* AVR Hardware I/O Register 0x2D */
#define AVR_IO_REG_ADDR_045  (*(volatile uint8_t *)(0x20 + 45))
#define AVR_IO_REG_045_BIT_0 (0)
#define AVR_IO_REG_045_BIT_1 (1)
#define AVR_IO_REG_045_BIT_2 (2)
#define AVR_IO_REG_045_BIT_3 (3)
#define AVR_IO_REG_045_BIT_4 (4)
#define AVR_IO_REG_045_BIT_5 (5)
#define AVR_IO_REG_045_BIT_6 (6)
#define AVR_IO_REG_045_BIT_7 (7)

/* AVR Hardware I/O Register 0x2E */
#define AVR_IO_REG_ADDR_046  (*(volatile uint8_t *)(0x20 + 46))
#define AVR_IO_REG_046_BIT_0 (0)
#define AVR_IO_REG_046_BIT_1 (1)
#define AVR_IO_REG_046_BIT_2 (2)
#define AVR_IO_REG_046_BIT_3 (3)
#define AVR_IO_REG_046_BIT_4 (4)
#define AVR_IO_REG_046_BIT_5 (5)
#define AVR_IO_REG_046_BIT_6 (6)
#define AVR_IO_REG_046_BIT_7 (7)

