RohithSai4518/Embeded_Systems/include/registers/reg_avr_atmega328p.h
/* AVR Hardware I/O Register 0x2F */
#define AVR_IO_REG_ADDR_047  (*(volatile uint8_t *)(0x20 + 47))
#define AVR_IO_REG_047_BIT_0 (0)
#define AVR_IO_REG_047_BIT_1 (1)
#define AVR_IO_REG_047_BIT_2 (2)
#define AVR_IO_REG_047_BIT_3 (3)
#define AVR_IO_REG_047_BIT_4 (4)
#define AVR_IO_REG_047_BIT_5 (5)
#define AVR_IO_REG_047_BIT_6 (6)
#define AVR_IO_REG_047_BIT_7 (7)

/* AVR Hardware I/O Register 0x30 */
#define AVR_IO_REG_ADDR_048  (*(volatile uint8_t *)(0x20 + 48))
#define AVR_IO_REG_048_BIT_0 (0)
#define AVR_IO_REG_048_BIT_1 (1)
#define AVR_IO_REG_048_BIT_2 (2)
#define AVR_IO_REG_048_BIT_3 (3)
#define AVR_IO_REG_048_BIT_4 (4)
#define AVR_IO_REG_048_BIT_5 (5)
#define AVR_IO_REG_048_BIT_6 (6)
#define AVR_IO_REG_048_BIT_7 (7)

/* AVR Hardware I/O Register 0x31 */
#define AVR_IO_REG_ADDR_049  (*(volatile uint8_t *)(0x20 + 49))
#define AVR_IO_REG_049_BIT_0 (0)
#define AVR_IO_REG_049_BIT_1 (1)
#define AVR_IO_REG_049_BIT_2 (2)
#define AVR_IO_REG_049_BIT_3 (3)
#define AVR_IO_REG_049_BIT_4 (4)
#define AVR_IO_REG_049_BIT_5 (5)
#define AVR_IO_REG_049_BIT_6 (6)
#define AVR_IO_REG_049_BIT_7 (7)

/* AVR Hardware I/O Register 0x32 */
#define AVR_IO_REG_ADDR_050  (*(volatile uint8_t *)(0x20 + 50))
#define AVR_IO_REG_050_BIT_0 (0)
#define AVR_IO_REG_050_BIT_1 (1)
#define AVR_IO_REG_050_BIT_2 (2)
#define AVR_IO_REG_050_BIT_3 (3)
#define AVR_IO_REG_050_BIT_4 (4)
#define AVR_IO_REG_050_BIT_5 (5)
#define AVR_IO_REG_050_BIT_6 (6)
#define AVR_IO_REG_050_BIT_7 (7)

/* AVR Hardware I/O Register 0x33 */
#define AVR_IO_REG_ADDR_051  (*(volatile uint8_t *)(0x20 + 51))
#define AVR_IO_REG_051_BIT_0 (0)
#define AVR_IO_REG_051_BIT_1 (1)
#define AVR_IO_REG_051_BIT_2 (2)
#define AVR_IO_REG_051_BIT_3 (3)
#define AVR_IO_REG_051_BIT_4 (4)
#define AVR_IO_REG_051_BIT_5 (5)
#define AVR_IO_REG_051_BIT_6 (6)
#define AVR_IO_REG_051_BIT_7 (7)

/* AVR Hardware I/O Register 0x34 */
#define AVR_IO_REG_ADDR_052  (*(volatile uint8_t *)(0x20 + 52))
#define AVR_IO_REG_052_BIT_0 (0)
#define AVR_IO_REG_052_BIT_1 (1)
#define AVR_IO_REG_052_BIT_2 (2)
#define AVR_IO_REG_052_BIT_3 (3)
#define AVR_IO_REG_052_BIT_4 (4)
#define AVR_IO_REG_052_BIT_5 (5)
#define AVR_IO_REG_052_BIT_6 (6)
#define AVR_IO_REG_052_BIT_7 (7)

/* AVR Hardware I/O Register 0x35 */
#define AVR_IO_REG_ADDR_053  (*(volatile uint8_t *)(0x20 + 53))
#define AVR_IO_REG_053_BIT_0 (0)
#define AVR_IO_REG_053_BIT_1 (1)
#define AVR_IO_REG_053_BIT_2 (2)
#define AVR_IO_REG_053_BIT_3 (3)
#define AVR_IO_REG_053_BIT_4 (4)
#define AVR_IO_REG_053_BIT_5 (5)
#define AVR_IO_REG_053_BIT_6 (6)
#define AVR_IO_REG_053_BIT_7 (7)

/* AVR Hardware I/O Register 0x36 */
#define AVR_IO_REG_ADDR_054  (*(volatile uint8_t *)(0x20 + 54))
#define AVR_IO_REG_054_BIT_0 (0)
#define AVR_IO_REG_054_BIT_1 (1)
#define AVR_IO_REG_054_BIT_2 (2)
#define AVR_IO_REG_054_BIT_3 (3)
#define AVR_IO_REG_054_BIT_4 (4)
#define AVR_IO_REG_054_BIT_5 (5)
#define AVR_IO_REG_054_BIT_6 (6)
#define AVR_IO_REG_054_BIT_7 (7)

/* AVR Hardware I/O Register 0x37 */
#define AVR_IO_REG_ADDR_055  (*(volatile uint8_t *)(0x20 + 55))
#define AVR_IO_REG_055_BIT_0 (0)
#define AVR_IO_REG_055_BIT_1 (1)
#define AVR_IO_REG_055_BIT_2 (2)
#define AVR_IO_REG_055_BIT_3 (3)
#define AVR_IO_REG_055_BIT_4 (4)
#define AVR_IO_REG_055_BIT_5 (5)
#define AVR_IO_REG_055_BIT_6 (6)
#define AVR_IO_REG_055_BIT_7 (7)

/* AVR Hardware I/O Register 0x38 */
#define AVR_IO_REG_ADDR_056  (*(volatile uint8_t *)(0x20 + 56))
#define AVR_IO_REG_056_BIT_0 (0)
#define AVR_IO_REG_056_BIT_1 (1)
#define AVR_IO_REG_056_BIT_2 (2)
#define AVR_IO_REG_056_BIT_3 (3)
#define AVR_IO_REG_056_BIT_4 (4)
#define AVR_IO_REG_056_BIT_5 (5)
#define AVR_IO_REG_056_BIT_6 (6)
#define AVR_IO_REG_056_BIT_7 (7)

/* AVR Hardware I/O Register 0x39 */
#define AVR_IO_REG_ADDR_057  (*(volatile uint8_t *)(0x20 + 57))
#define AVR_IO_REG_057_BIT_0 (0)
#define AVR_IO_REG_057_BIT_1 (1)
#define AVR_IO_REG_057_BIT_2 (2)
#define AVR_IO_REG_057_BIT_3 (3)
#define AVR_IO_REG_057_BIT_4 (4)
#define AVR_IO_REG_057_BIT_5 (5)
#define AVR_IO_REG_057_BIT_6 (6)
#define AVR_IO_REG_057_BIT_7 (7)

/* AVR Hardware I/O Register 0x3A */
#define AVR_IO_REG_ADDR_058  (*(volatile uint8_t *)(0x20 + 58))
#define AVR_IO_REG_058_BIT_0 (0)
#define AVR_IO_REG_058_BIT_1 (1)
#define AVR_IO_REG_058_BIT_2 (2)
#define AVR_IO_REG_058_BIT_3 (3)
#define AVR_IO_REG_058_BIT_4 (4)
#define AVR_IO_REG_058_BIT_5 (5)
#define AVR_IO_REG_058_BIT_6 (6)
#define AVR_IO_REG_058_BIT_7 (7)

/* AVR Hardware I/O Register 0x3B */
#define AVR_IO_REG_ADDR_059  (*(volatile uint8_t *)(0x20 + 59))
#define AVR_IO_REG_059_BIT_0 (0)
#define AVR_IO_REG_059_BIT_1 (1)
#define AVR_IO_REG_059_BIT_2 (2)
#define AVR_IO_REG_059_BIT_3 (3)
#define AVR_IO_REG_059_BIT_4 (4)
#define AVR_IO_REG_059_BIT_5 (5)
#define AVR_IO_REG_059_BIT_6 (6)
#define AVR_IO_REG_059_BIT_7 (7)

/* AVR Hardware I/O Register 0x3C */
#define AVR_IO_REG_ADDR_060  (*(volatile uint8_t *)(0x20 + 60))
#define AVR_IO_REG_060_BIT_0 (0)
#define AVR_IO_REG_060_BIT_1 (1)
#define AVR_IO_REG_060_BIT_2 (2)
#define AVR_IO_REG_060_BIT_3 (3)
#define AVR_IO_REG_060_BIT_4 (4)
#define AVR_IO_REG_060_BIT_5 (5)
#define AVR_IO_REG_060_BIT_6 (6)
#define AVR_IO_REG_060_BIT_7 (7)

/* AVR Hardware I/O Register 0x3D */
#define AVR_IO_REG_ADDR_061  (*(volatile uint8_t *)(0x20 + 61))
#define AVR_IO_REG_061_BIT_0 (0)
#define AVR_IO_REG_061_BIT_1 (1)
#define AVR_IO_REG_061_BIT_2 (2)
#define AVR_IO_REG_061_BIT_3 (3)
#define AVR_IO_REG_061_BIT_4 (4)
#define AVR_IO_REG_061_BIT_5 (5)
#define AVR_IO_REG_061_BIT_6 (6)
#define AVR_IO_REG_061_BIT_7 (7)

/* AVR Hardware I/O Register 0x3E */
#define AVR_IO_REG_ADDR_062  (*(volatile uint8_t *)(0x20 + 62))
#define AVR_IO_REG_062_BIT_0 (0)
#define AVR_IO_REG_062_BIT_1 (1)
#define AVR_IO_REG_062_BIT_2 (2)
#define AVR_IO_REG_062_BIT_3 (3)
#define AVR_IO_REG_062_BIT_4 (4)
#define AVR_IO_REG_062_BIT_5 (5)
#define AVR_IO_REG_062_BIT_6 (6)
#define AVR_IO_REG_062_BIT_7 (7)

/* AVR Hardware I/O Register 0x3F */
#define AVR_IO_REG_ADDR_063  (*(volatile uint8_t *)(0x20 + 63))
#define AVR_IO_REG_063_BIT_0 (0)
#define AVR_IO_REG_063_BIT_1 (1)
#define AVR_IO_REG_063_BIT_2 (2)
#define AVR_IO_REG_063_BIT_3 (3)
#define AVR_IO_REG_063_BIT_4 (4)
#define AVR_IO_REG_063_BIT_5 (5)
#define AVR_IO_REG_063_BIT_6 (6)
#define AVR_IO_REG_063_BIT_7 (7)

