RohithSai4518/Embeded_Systems/include/registers/reg_avr_atmega328p.h
/* AVR Hardware I/O Register 0x40 */
#define AVR_IO_REG_ADDR_064  (*(volatile uint8_t *)(0x20 + 64))
#define AVR_IO_REG_064_BIT_0 (0)
#define AVR_IO_REG_064_BIT_1 (1)
#define AVR_IO_REG_064_BIT_2 (2)
#define AVR_IO_REG_064_BIT_3 (3)
#define AVR_IO_REG_064_BIT_4 (4)
#define AVR_IO_REG_064_BIT_5 (5)
#define AVR_IO_REG_064_BIT_6 (6)
#define AVR_IO_REG_064_BIT_7 (7)

/* AVR Hardware I/O Register 0x41 */
#define AVR_IO_REG_ADDR_065  (*(volatile uint8_t *)(0x20 + 65))
#define AVR_IO_REG_065_BIT_0 (0)
#define AVR_IO_REG_065_BIT_1 (1)
#define AVR_IO_REG_065_BIT_2 (2)
#define AVR_IO_REG_065_BIT_3 (3)
#define AVR_IO_REG_065_BIT_4 (4)
#define AVR_IO_REG_065_BIT_5 (5)
#define AVR_IO_REG_065_BIT_6 (6)
#define AVR_IO_REG_065_BIT_7 (7)

/* AVR Hardware I/O Register 0x42 */
#define AVR_IO_REG_ADDR_066  (*(volatile uint8_t *)(0x20 + 66))
#define AVR_IO_REG_066_BIT_0 (0)
#define AVR_IO_REG_066_BIT_1 (1)
#define AVR_IO_REG_066_BIT_2 (2)
#define AVR_IO_REG_066_BIT_3 (3)
#define AVR_IO_REG_066_BIT_4 (4)
#define AVR_IO_REG_066_BIT_5 (5)
#define AVR_IO_REG_066_BIT_6 (6)
#define AVR_IO_REG_066_BIT_7 (7)

/* AVR Hardware I/O Register 0x43 */
#define AVR_IO_REG_ADDR_067  (*(volatile uint8_t *)(0x20 + 67))
#define AVR_IO_REG_067_BIT_0 (0)
#define AVR_IO_REG_067_BIT_1 (1)
#define AVR_IO_REG_067_BIT_2 (2)
#define AVR_IO_REG_067_BIT_3 (3)
#define AVR_IO_REG_067_BIT_4 (4)
#define AVR_IO_REG_067_BIT_5 (5)
#define AVR_IO_REG_067_BIT_6 (6)
#define AVR_IO_REG_067_BIT_7 (7)

/* AVR Hardware I/O Register 0x44 */
#define AVR_IO_REG_ADDR_068  (*(volatile uint8_t *)(0x20 + 68))
#define AVR_IO_REG_068_BIT_0 (0)
#define AVR_IO_REG_068_BIT_1 (1)
#define AVR_IO_REG_068_BIT_2 (2)
#define AVR_IO_REG_068_BIT_3 (3)
#define AVR_IO_REG_068_BIT_4 (4)
#define AVR_IO_REG_068_BIT_5 (5)
#define AVR_IO_REG_068_BIT_6 (6)
#define AVR_IO_REG_068_BIT_7 (7)

/* AVR Hardware I/O Register 0x45 */
#define AVR_IO_REG_ADDR_069  (*(volatile uint8_t *)(0x20 + 69))
#define AVR_IO_REG_069_BIT_0 (0)
#define AVR_IO_REG_069_BIT_1 (1)
#define AVR_IO_REG_069_BIT_2 (2)
#define AVR_IO_REG_069_BIT_3 (3)
#define AVR_IO_REG_069_BIT_4 (4)
#define AVR_IO_REG_069_BIT_5 (5)
#define AVR_IO_REG_069_BIT_6 (6)
#define AVR_IO_REG_069_BIT_7 (7)

/* AVR Hardware I/O Register 0x46 */
#define AVR_IO_REG_ADDR_070  (*(volatile uint8_t *)(0x20 + 70))
#define AVR_IO_REG_070_BIT_0 (0)
#define AVR_IO_REG_070_BIT_1 (1)
#define AVR_IO_REG_070_BIT_2 (2)
#define AVR_IO_REG_070_BIT_3 (3)
#define AVR_IO_REG_070_BIT_4 (4)
#define AVR_IO_REG_070_BIT_5 (5)
#define AVR_IO_REG_070_BIT_6 (6)
#define AVR_IO_REG_070_BIT_7 (7)

/* AVR Hardware I/O Register 0x47 */
#define AVR_IO_REG_ADDR_071  (*(volatile uint8_t *)(0x20 + 71))
#define AVR_IO_REG_071_BIT_0 (0)
#define AVR_IO_REG_071_BIT_1 (1)
#define AVR_IO_REG_071_BIT_2 (2)
#define AVR_IO_REG_071_BIT_3 (3)
#define AVR_IO_REG_071_BIT_4 (4)
#define AVR_IO_REG_071_BIT_5 (5)
#define AVR_IO_REG_071_BIT_6 (6)
#define AVR_IO_REG_071_BIT_7 (7)

/* AVR Hardware I/O Register 0x48 */
#define AVR_IO_REG_ADDR_072  (*(volatile uint8_t *)(0x20 + 72))
#define AVR_IO_REG_072_BIT_0 (0)
#define AVR_IO_REG_072_BIT_1 (1)
#define AVR_IO_REG_072_BIT_2 (2)
#define AVR_IO_REG_072_BIT_3 (3)
#define AVR_IO_REG_072_BIT_4 (4)
#define AVR_IO_REG_072_BIT_5 (5)
#define AVR_IO_REG_072_BIT_6 (6)
#define AVR_IO_REG_072_BIT_7 (7)

/* AVR Hardware I/O Register 0x49 */
#define AVR_IO_REG_ADDR_073  (*(volatile uint8_t *)(0x20 + 73))
#define AVR_IO_REG_073_BIT_0 (0)
#define AVR_IO_REG_073_BIT_1 (1)
#define AVR_IO_REG_073_BIT_2 (2)
#define AVR_IO_REG_073_BIT_3 (3)
#define AVR_IO_REG_073_BIT_4 (4)
#define AVR_IO_REG_073_BIT_5 (5)
#define AVR_IO_REG_073_BIT_6 (6)
#define AVR_IO_REG_073_BIT_7 (7)

/* AVR Hardware I/O Register 0x4A */
#define AVR_IO_REG_ADDR_074  (*(volatile uint8_t *)(0x20 + 74))
#define AVR_IO_REG_074_BIT_0 (0)
#define AVR_IO_REG_074_BIT_1 (1)
#define AVR_IO_REG_074_BIT_2 (2)
#define AVR_IO_REG_074_BIT_3 (3)
#define AVR_IO_REG_074_BIT_4 (4)
#define AVR_IO_REG_074_BIT_5 (5)
#define AVR_IO_REG_074_BIT_6 (6)
#define AVR_IO_REG_074_BIT_7 (7)

/* AVR Hardware I/O Register 0x4B */
#define AVR_IO_REG_ADDR_075  (*(volatile uint8_t *)(0x20 + 75))
#define AVR_IO_REG_075_BIT_0 (0)
#define AVR_IO_REG_075_BIT_1 (1)
#define AVR_IO_REG_075_BIT_2 (2)
#define AVR_IO_REG_075_BIT_3 (3)
#define AVR_IO_REG_075_BIT_4 (4)
#define AVR_IO_REG_075_BIT_5 (5)
#define AVR_IO_REG_075_BIT_6 (6)
#define AVR_IO_REG_075_BIT_7 (7)

/* AVR Hardware I/O Register 0x4C */
#define AVR_IO_REG_ADDR_076  (*(volatile uint8_t *)(0x20 + 76))
#define AVR_IO_REG_076_BIT_0 (0)
#define AVR_IO_REG_076_BIT_1 (1)
#define AVR_IO_REG_076_BIT_2 (2)
#define AVR_IO_REG_076_BIT_3 (3)
#define AVR_IO_REG_076_BIT_4 (4)
#define AVR_IO_REG_076_BIT_5 (5)
#define AVR_IO_REG_076_BIT_6 (6)
#define AVR_IO_REG_076_BIT_7 (7)

/* AVR Hardware I/O Register 0x4D */
#define AVR_IO_REG_ADDR_077  (*(volatile uint8_t *)(0x20 + 77))
#define AVR_IO_REG_077_BIT_0 (0)
#define AVR_IO_REG_077_BIT_1 (1)
#define AVR_IO_REG_077_BIT_2 (2)
#define AVR_IO_REG_077_BIT_3 (3)
#define AVR_IO_REG_077_BIT_4 (4)
#define AVR_IO_REG_077_BIT_5 (5)
#define AVR_IO_REG_077_BIT_6 (6)
#define AVR_IO_REG_077_BIT_7 (7)

/* AVR Hardware I/O Register 0x4E */
#define AVR_IO_REG_ADDR_078  (*(volatile uint8_t *)(0x20 + 78))
#define AVR_IO_REG_078_BIT_0 (0)
#define AVR_IO_REG_078_BIT_1 (1)
#define AVR_IO_REG_078_BIT_2 (2)
#define AVR_IO_REG_078_BIT_3 (3)
#define AVR_IO_REG_078_BIT_4 (4)
#define AVR_IO_REG_078_BIT_5 (5)
#define AVR_IO_REG_078_BIT_6 (6)
#define AVR_IO_REG_078_BIT_7 (7)

/* AVR Hardware I/O Register 0x4F */
#define AVR_IO_REG_ADDR_079  (*(volatile uint8_t *)(0x20 + 79))
#define AVR_IO_REG_079_BIT_0 (0)
#define AVR_IO_REG_079_BIT_1 (1)
#define AVR_IO_REG_079_BIT_2 (2)
#define AVR_IO_REG_079_BIT_3 (3)
#define AVR_IO_REG_079_BIT_4 (4)
#define AVR_IO_REG_079_BIT_5 (5)
#define AVR_IO_REG_079_BIT_6 (6)
#define AVR_IO_REG_079_BIT_7 (7)

/* AVR Hardware I/O Register 0x50 */
#define AVR_IO_REG_ADDR_080  (*(volatile uint8_t *)(0x20 + 80))
#define AVR_IO_REG_080_BIT_0 (0)
#define AVR_IO_REG_080_BIT_1 (1)
#define AVR_IO_REG_080_BIT_2 (2)
#define AVR_IO_REG_080_BIT_3 (3)
#define AVR_IO_REG_080_BIT_4 (4)
#define AVR_IO_REG_080_BIT_5 (5)
#define AVR_IO_REG_080_BIT_6 (6)
#define AVR_IO_REG_080_BIT_7 (7)

/* AVR Hardware I/O Register 0x51 */
#define AVR_IO_REG_ADDR_081  (*(volatile uint8_t *)(0x20 + 81))
#define AVR_IO_REG_081_BIT_0 (0)
#define AVR_IO_REG_081_BIT_1 (1)
#define AVR_IO_REG_081_BIT_2 (2)
#define AVR_IO_REG_081_BIT_3 (3)
#define AVR_IO_REG_081_BIT_4 (4)
#define AVR_IO_REG_081_BIT_5 (5)
#define AVR_IO_REG_081_BIT_6 (6)
#define AVR_IO_REG_081_BIT_7 (7)

/* AVR Hardware I/O Register 0x52 */
#define AVR_IO_REG_ADDR_082  (*(volatile uint8_t *)(0x20 + 82))
#define AVR_IO_REG_082_BIT_0 (0)
#define AVR_IO_REG_082_BIT_1 (1)
#define AVR_IO_REG_082_BIT_2 (2)
#define AVR_IO_REG_082_BIT_3 (3)
#define AVR_IO_REG_082_BIT_4 (4)
#define AVR_IO_REG_082_BIT_5 (5)
#define AVR_IO_REG_082_BIT_6 (6)
#define AVR_IO_REG_082_BIT_7 (7)

/* AVR Hardware I/O Register 0x53 */
#define AVR_IO_REG_ADDR_083  (*(volatile uint8_t *)(0x20 + 83))
#define AVR_IO_REG_083_BIT_0 (0)
#define AVR_IO_REG_083_BIT_1 (1)
#define AVR_IO_REG_083_BIT_2 (2)
#define AVR_IO_REG_083_BIT_3 (3)
#define AVR_IO_REG_083_BIT_4 (4)
#define AVR_IO_REG_083_BIT_5 (5)
#define AVR_IO_REG_083_BIT_6 (6)
#define AVR_IO_REG_083_BIT_7 (7)

/* AVR Hardware I/O Register 0x54 */
#define AVR_IO_REG_ADDR_084  (*(volatile uint8_t *)(0x20 + 84))
#define AVR_IO_REG_084_BIT_0 (0)
#define AVR_IO_REG_084_BIT_1 (1)
#define AVR_IO_REG_084_BIT_2 (2)
#define AVR_IO_REG_084_BIT_3 (3)
#define AVR_IO_REG_084_BIT_4 (4)
#define AVR_IO_REG_084_BIT_5 (5)
#define AVR_IO_REG_084_BIT_6 (6)
#define AVR_IO_REG_084_BIT_7 (7)

/* AVR Hardware I/O Register 0x55 */
#define AVR_IO_REG_ADDR_085  (*(volatile uint8_t *)(0x20 + 85))
#define AVR_IO_REG_085_BIT_0 (0)
#define AVR_IO_REG_085_BIT_1 (1)
#define AVR_IO_REG_085_BIT_2 (2)
#define AVR_IO_REG_085_BIT_3 (3)
#define AVR_IO_REG_085_BIT_4 (4)
#define AVR_IO_REG_085_BIT_5 (5)
#define AVR_IO_REG_085_BIT_6 (6)
#define AVR_IO_REG_085_BIT_7 (7)

