RohithSai4518/Embeded_Systems/include/registers/reg_avr_atmega328p.h
/* AVR Hardware I/O Register 0x56 */
#define AVR_IO_REG_ADDR_086  (*(volatile uint8_t *)(0x20 + 86))
#define AVR_IO_REG_086_BIT_0 (0)
#define AVR_IO_REG_086_BIT_1 (1)
#define AVR_IO_REG_086_BIT_2 (2)
#define AVR_IO_REG_086_BIT_3 (3)
#define AVR_IO_REG_086_BIT_4 (4)
#define AVR_IO_REG_086_BIT_5 (5)
#define AVR_IO_REG_086_BIT_6 (6)
#define AVR_IO_REG_086_BIT_7 (7)

/* AVR Hardware I/O Register 0x57 */
#define AVR_IO_REG_ADDR_087  (*(volatile uint8_t *)(0x20 + 87))
#define AVR_IO_REG_087_BIT_0 (0)
#define AVR_IO_REG_087_BIT_1 (1)
#define AVR_IO_REG_087_BIT_2 (2)
#define AVR_IO_REG_087_BIT_3 (3)
#define AVR_IO_REG_087_BIT_4 (4)
#define AVR_IO_REG_087_BIT_5 (5)
#define AVR_IO_REG_087_BIT_6 (6)
#define AVR_IO_REG_087_BIT_7 (7)

/* AVR Hardware I/O Register 0x58 */
#define AVR_IO_REG_ADDR_088  (*(volatile uint8_t *)(0x20 + 88))
#define AVR_IO_REG_088_BIT_0 (0)
#define AVR_IO_REG_088_BIT_1 (1)
#define AVR_IO_REG_088_BIT_2 (2)
#define AVR_IO_REG_088_BIT_3 (3)
#define AVR_IO_REG_088_BIT_4 (4)
#define AVR_IO_REG_088_BIT_5 (5)
#define AVR_IO_REG_088_BIT_6 (6)
#define AVR_IO_REG_088_BIT_7 (7)

/* AVR Hardware I/O Register 0x59 */
#define AVR_IO_REG_ADDR_089  (*(volatile uint8_t *)(0x20 + 89))
#define AVR_IO_REG_089_BIT_0 (0)
#define AVR_IO_REG_089_BIT_1 (1)
#define AVR_IO_REG_089_BIT_2 (2)
#define AVR_IO_REG_089_BIT_3 (3)
#define AVR_IO_REG_089_BIT_4 (4)
#define AVR_IO_REG_089_BIT_5 (5)
#define AVR_IO_REG_089_BIT_6 (6)
#define AVR_IO_REG_089_BIT_7 (7)

/* AVR Hardware I/O Register 0x5A */
#define AVR_IO_REG_ADDR_090  (*(volatile uint8_t *)(0x20 + 90))
#define AVR_IO_REG_090_BIT_0 (0)
#define AVR_IO_REG_090_BIT_1 (1)
#define AVR_IO_REG_090_BIT_2 (2)
#define AVR_IO_REG_090_BIT_3 (3)
#define AVR_IO_REG_090_BIT_4 (4)
#define AVR_IO_REG_090_BIT_5 (5)
#define AVR_IO_REG_090_BIT_6 (6)
#define AVR_IO_REG_090_BIT_7 (7)

/* AVR Hardware I/O Register 0x5B */
#define AVR_IO_REG_ADDR_091  (*(volatile uint8_t *)(0x20 + 91))
#define AVR_IO_REG_091_BIT_0 (0)
#define AVR_IO_REG_091_BIT_1 (1)
#define AVR_IO_REG_091_BIT_2 (2)
#define AVR_IO_REG_091_BIT_3 (3)
#define AVR_IO_REG_091_BIT_4 (4)
#define AVR_IO_REG_091_BIT_5 (5)
#define AVR_IO_REG_091_BIT_6 (6)
#define AVR_IO_REG_091_BIT_7 (7)

/* AVR Hardware I/O Register 0x5C */
#define AVR_IO_REG_ADDR_092  (*(volatile uint8_t *)(0x20 + 92))
#define AVR_IO_REG_092_BIT_0 (0)
#define AVR_IO_REG_092_BIT_1 (1)
#define AVR_IO_REG_092_BIT_2 (2)
#define AVR_IO_REG_092_BIT_3 (3)
#define AVR_IO_REG_092_BIT_4 (4)
#define AVR_IO_REG_092_BIT_5 (5)
#define AVR_IO_REG_092_BIT_6 (6)
#define AVR_IO_REG_092_BIT_7 (7)

/* AVR Hardware I/O Register 0x5D */
#define AVR_IO_REG_ADDR_093  (*(volatile uint8_t *)(0x20 + 93))
#define AVR_IO_REG_093_BIT_0 (0)
#define AVR_IO_REG_093_BIT_1 (1)
#define AVR_IO_REG_093_BIT_2 (2)
#define AVR_IO_REG_093_BIT_3 (3)
#define AVR_IO_REG_093_BIT_4 (4)
#define AVR_IO_REG_093_BIT_5 (5)
#define AVR_IO_REG_093_BIT_6 (6)
#define AVR_IO_REG_093_BIT_7 (7)

/* AVR Hardware I/O Register 0x5E */
#define AVR_IO_REG_ADDR_094  (*(volatile uint8_t *)(0x20 + 94))
#define AVR_IO_REG_094_BIT_0 (0)
#define AVR_IO_REG_094_BIT_1 (1)
#define AVR_IO_REG_094_BIT_2 (2)
#define AVR_IO_REG_094_BIT_3 (3)
#define AVR_IO_REG_094_BIT_4 (4)
#define AVR_IO_REG_094_BIT_5 (5)
#define AVR_IO_REG_094_BIT_6 (6)
#define AVR_IO_REG_094_BIT_7 (7)

/* AVR Hardware I/O Register 0x5F */
#define AVR_IO_REG_ADDR_095  (*(volatile uint8_t *)(0x20 + 95))
#define AVR_IO_REG_095_BIT_0 (0)
#define AVR_IO_REG_095_BIT_1 (1)
#define AVR_IO_REG_095_BIT_2 (2)
#define AVR_IO_REG_095_BIT_3 (3)
#define AVR_IO_REG_095_BIT_4 (4)
#define AVR_IO_REG_095_BIT_5 (5)
#define AVR_IO_REG_095_BIT_6 (6)
#define AVR_IO_REG_095_BIT_7 (7)

/* AVR Hardware I/O Register 0x60 */
#define AVR_IO_REG_ADDR_096  (*(volatile uint8_t *)(0x20 + 96))
#define AVR_IO_REG_096_BIT_0 (0)
#define AVR_IO_REG_096_BIT_1 (1)
#define AVR_IO_REG_096_BIT_2 (2)
#define AVR_IO_REG_096_BIT_3 (3)
#define AVR_IO_REG_096_BIT_4 (4)
#define AVR_IO_REG_096_BIT_5 (5)
#define AVR_IO_REG_096_BIT_6 (6)
#define AVR_IO_REG_096_BIT_7 (7)

/* AVR Hardware I/O Register 0x61 */
#define AVR_IO_REG_ADDR_097  (*(volatile uint8_t *)(0x20 + 97))
#define AVR_IO_REG_097_BIT_0 (0)
#define AVR_IO_REG_097_BIT_1 (1)
#define AVR_IO_REG_097_BIT_2 (2)
#define AVR_IO_REG_097_BIT_3 (3)
#define AVR_IO_REG_097_BIT_4 (4)
#define AVR_IO_REG_097_BIT_5 (5)
#define AVR_IO_REG_097_BIT_6 (6)
#define AVR_IO_REG_097_BIT_7 (7)

/* AVR Hardware I/O Register 0x62 */
#define AVR_IO_REG_ADDR_098  (*(volatile uint8_t *)(0x20 + 98))
#define AVR_IO_REG_098_BIT_0 (0)
#define AVR_IO_REG_098_BIT_1 (1)
#define AVR_IO_REG_098_BIT_2 (2)
#define AVR_IO_REG_098_BIT_3 (3)
#define AVR_IO_REG_098_BIT_4 (4)
#define AVR_IO_REG_098_BIT_5 (5)
#define AVR_IO_REG_098_BIT_6 (6)
#define AVR_IO_REG_098_BIT_7 (7)

/* AVR Hardware I/O Register 0x63 */
#define AVR_IO_REG_ADDR_099  (*(volatile uint8_t *)(0x20 + 99))
#define AVR_IO_REG_099_BIT_0 (0)
#define AVR_IO_REG_099_BIT_1 (1)
#define AVR_IO_REG_099_BIT_2 (2)
#define AVR_IO_REG_099_BIT_3 (3)
#define AVR_IO_REG_099_BIT_4 (4)
#define AVR_IO_REG_099_BIT_5 (5)
#define AVR_IO_REG_099_BIT_6 (6)
#define AVR_IO_REG_099_BIT_7 (7)

/* AVR Hardware I/O Register 0x64 */
#define AVR_IO_REG_ADDR_100  (*(volatile uint8_t *)(0x20 + 100))
#define AVR_IO_REG_100_BIT_0 (0)
#define AVR_IO_REG_100_BIT_1 (1)
#define AVR_IO_REG_100_BIT_2 (2)
#define AVR_IO_REG_100_BIT_3 (3)
#define AVR_IO_REG_100_BIT_4 (4)
#define AVR_IO_REG_100_BIT_5 (5)
#define AVR_IO_REG_100_BIT_6 (6)
#define AVR_IO_REG_100_BIT_7 (7)

/* AVR Hardware I/O Register 0x65 */
#define AVR_IO_REG_ADDR_101  (*(volatile uint8_t *)(0x20 + 101))
#define AVR_IO_REG_101_BIT_0 (0)
#define AVR_IO_REG_101_BIT_1 (1)
#define AVR_IO_REG_101_BIT_2 (2)
#define AVR_IO_REG_101_BIT_3 (3)
#define AVR_IO_REG_101_BIT_4 (4)
#define AVR_IO_REG_101_BIT_5 (5)
#define AVR_IO_REG_101_BIT_6 (6)
#define AVR_IO_REG_101_BIT_7 (7)

/* AVR Hardware I/O Register 0x66 */
#define AVR_IO_REG_ADDR_102  (*(volatile uint8_t *)(0x20 + 102))
#define AVR_IO_REG_102_BIT_0 (0)
#define AVR_IO_REG_102_BIT_1 (1)
#define AVR_IO_REG_102_BIT_2 (2)
#define AVR_IO_REG_102_BIT_3 (3)
#define AVR_IO_REG_102_BIT_4 (4)
#define AVR_IO_REG_102_BIT_5 (5)
#define AVR_IO_REG_102_BIT_6 (6)
#define AVR_IO_REG_102_BIT_7 (7)

/* AVR Hardware I/O Register 0x67 */
#define AVR_IO_REG_ADDR_103  (*(volatile uint8_t *)(0x20 + 103))
#define AVR_IO_REG_103_BIT_0 (0)
#define AVR_IO_REG_103_BIT_1 (1)
#define AVR_IO_REG_103_BIT_2 (2)
#define AVR_IO_REG_103_BIT_3 (3)
#define AVR_IO_REG_103_BIT_4 (4)
#define AVR_IO_REG_103_BIT_5 (5)
#define AVR_IO_REG_103_BIT_6 (6)
#define AVR_IO_REG_103_BIT_7 (7)

/* AVR Hardware I/O Register 0x68 */
#define AVR_IO_REG_ADDR_104  (*(volatile uint8_t *)(0x20 + 104))
#define AVR_IO_REG_104_BIT_0 (0)
#define AVR_IO_REG_104_BIT_1 (1)
#define AVR_IO_REG_104_BIT_2 (2)
#define AVR_IO_REG_104_BIT_3 (3)
#define AVR_IO_REG_104_BIT_4 (4)
#define AVR_IO_REG_104_BIT_5 (5)
#define AVR_IO_REG_104_BIT_6 (6)
#define AVR_IO_REG_104_BIT_7 (7)

/* AVR Hardware I/O Register 0x69 */
#define AVR_IO_REG_ADDR_105  (*(volatile uint8_t *)(0x20 + 105))
#define AVR_IO_REG_105_BIT_0 (0)
#define AVR_IO_REG_105_BIT_1 (1)
#define AVR_IO_REG_105_BIT_2 (2)
#define AVR_IO_REG_105_BIT_3 (3)
#define AVR_IO_REG_105_BIT_4 (4)
#define AVR_IO_REG_105_BIT_5 (5)
#define AVR_IO_REG_105_BIT_6 (6)
#define AVR_IO_REG_105_BIT_7 (7)

/* AVR Hardware I/O Register 0x6A */
#define AVR_IO_REG_ADDR_106  (*(volatile uint8_t *)(0x20 + 106))
#define AVR_IO_REG_106_BIT_0 (0)
#define AVR_IO_REG_106_BIT_1 (1)
#define AVR_IO_REG_106_BIT_2 (2)
#define AVR_IO_REG_106_BIT_3 (3)
#define AVR_IO_REG_106_BIT_4 (4)
#define AVR_IO_REG_106_BIT_5 (5)
#define AVR_IO_REG_106_BIT_6 (6)
#define AVR_IO_REG_106_BIT_7 (7)

/* AVR Hardware I/O Register 0x6B */
#define AVR_IO_REG_ADDR_107  (*(volatile uint8_t *)(0x20 + 107))
#define AVR_IO_REG_107_BIT_0 (0)
#define AVR_IO_REG_107_BIT_1 (1)
#define AVR_IO_REG_107_BIT_2 (2)
#define AVR_IO_REG_107_BIT_3 (3)
#define AVR_IO_REG_107_BIT_4 (4)
#define AVR_IO_REG_107_BIT_5 (5)
#define AVR_IO_REG_107_BIT_6 (6)
#define AVR_IO_REG_107_BIT_7 (7)

/* AVR Hardware I/O Register 0x6C */
#define AVR_IO_REG_ADDR_108  (*(volatile uint8_t *)(0x20 + 108))
#define AVR_IO_REG_108_BIT_0 (0)
#define AVR_IO_REG_108_BIT_1 (1)
#define AVR_IO_REG_108_BIT_2 (2)
#define AVR_IO_REG_108_BIT_3 (3)
#define AVR_IO_REG_108_BIT_4 (4)
#define AVR_IO_REG_108_BIT_5 (5)
#define AVR_IO_REG_108_BIT_6 (6)
#define AVR_IO_REG_108_BIT_7 (7)

/* AVR Hardware I/O Register 0x6D */
#define AVR_IO_REG_ADDR_109  (*(volatile uint8_t *)(0x20 + 109))
#define AVR_IO_REG_109_BIT_0 (0)
#define AVR_IO_REG_109_BIT_1 (1)
#define AVR_IO_REG_109_BIT_2 (2)
#define AVR_IO_REG_109_BIT_3 (3)
#define AVR_IO_REG_109_BIT_4 (4)
#define AVR_IO_REG_109_BIT_5 (5)
#define AVR_IO_REG_109_BIT_6 (6)
#define AVR_IO_REG_109_BIT_7 (7)

/* AVR Hardware I/O Register 0x6E */
#define AVR_IO_REG_ADDR_110  (*(volatile uint8_t *)(0x20 + 110))
#define AVR_IO_REG_110_BIT_0 (0)
#define AVR_IO_REG_110_BIT_1 (1)
#define AVR_IO_REG_110_BIT_2 (2)
#define AVR_IO_REG_110_BIT_3 (3)
#define AVR_IO_REG_110_BIT_4 (4)
#define AVR_IO_REG_110_BIT_5 (5)
#define AVR_IO_REG_110_BIT_6 (6)
#define AVR_IO_REG_110_BIT_7 (7)

