RohithSai4518/Embeded_Systems/include/registers/reg_avr_atmega328p.h
/* AVR Hardware I/O Register 0x6F */
#define AVR_IO_REG_ADDR_111  (*(volatile uint8_t *)(0x20 + 111))
#define AVR_IO_REG_111_BIT_0 (0)
#define AVR_IO_REG_111_BIT_1 (1)
#define AVR_IO_REG_111_BIT_2 (2)
#define AVR_IO_REG_111_BIT_3 (3)
#define AVR_IO_REG_111_BIT_4 (4)
#define AVR_IO_REG_111_BIT_5 (5)
#define AVR_IO_REG_111_BIT_6 (6)
#define AVR_IO_REG_111_BIT_7 (7)

/* AVR Hardware I/O Register 0x70 */
#define AVR_IO_REG_ADDR_112  (*(volatile uint8_t *)(0x20 + 112))
#define AVR_IO_REG_112_BIT_0 (0)
#define AVR_IO_REG_112_BIT_1 (1)
#define AVR_IO_REG_112_BIT_2 (2)
#define AVR_IO_REG_112_BIT_3 (3)
#define AVR_IO_REG_112_BIT_4 (4)
#define AVR_IO_REG_112_BIT_5 (5)
#define AVR_IO_REG_112_BIT_6 (6)
#define AVR_IO_REG_112_BIT_7 (7)

/* AVR Hardware I/O Register 0x71 */
#define AVR_IO_REG_ADDR_113  (*(volatile uint8_t *)(0x20 + 113))
#define AVR_IO_REG_113_BIT_0 (0)
#define AVR_IO_REG_113_BIT_1 (1)
#define AVR_IO_REG_113_BIT_2 (2)
#define AVR_IO_REG_113_BIT_3 (3)
#define AVR_IO_REG_113_BIT_4 (4)
#define AVR_IO_REG_113_BIT_5 (5)
#define AVR_IO_REG_113_BIT_6 (6)
#define AVR_IO_REG_113_BIT_7 (7)

/* AVR Hardware I/O Register 0x72 */
#define AVR_IO_REG_ADDR_114  (*(volatile uint8_t *)(0x20 + 114))
#define AVR_IO_REG_114_BIT_0 (0)
#define AVR_IO_REG_114_BIT_1 (1)
#define AVR_IO_REG_114_BIT_2 (2)
#define AVR_IO_REG_114_BIT_3 (3)
#define AVR_IO_REG_114_BIT_4 (4)
#define AVR_IO_REG_114_BIT_5 (5)
#define AVR_IO_REG_114_BIT_6 (6)
#define AVR_IO_REG_114_BIT_7 (7)

/* AVR Hardware I/O Register 0x73 */
#define AVR_IO_REG_ADDR_115  (*(volatile uint8_t *)(0x20 + 115))
#define AVR_IO_REG_115_BIT_0 (0)
#define AVR_IO_REG_115_BIT_1 (1)
#define AVR_IO_REG_115_BIT_2 (2)
#define AVR_IO_REG_115_BIT_3 (3)
#define AVR_IO_REG_115_BIT_4 (4)
#define AVR_IO_REG_115_BIT_5 (5)
#define AVR_IO_REG_115_BIT_6 (6)
#define AVR_IO_REG_115_BIT_7 (7)

/* AVR Hardware I/O Register 0x74 */
#define AVR_IO_REG_ADDR_116  (*(volatile uint8_t *)(0x20 + 116))
#define AVR_IO_REG_116_BIT_0 (0)
#define AVR_IO_REG_116_BIT_1 (1)
#define AVR_IO_REG_116_BIT_2 (2)
#define AVR_IO_REG_116_BIT_3 (3)
#define AVR_IO_REG_116_BIT_4 (4)
#define AVR_IO_REG_116_BIT_5 (5)
#define AVR_IO_REG_116_BIT_6 (6)
#define AVR_IO_REG_116_BIT_7 (7)

/* AVR Hardware I/O Register 0x75 */
#define AVR_IO_REG_ADDR_117  (*(volatile uint8_t *)(0x20 + 117))
#define AVR_IO_REG_117_BIT_0 (0)
#define AVR_IO_REG_117_BIT_1 (1)
#define AVR_IO_REG_117_BIT_2 (2)
#define AVR_IO_REG_117_BIT_3 (3)
#define AVR_IO_REG_117_BIT_4 (4)
#define AVR_IO_REG_117_BIT_5 (5)
#define AVR_IO_REG_117_BIT_6 (6)
#define AVR_IO_REG_117_BIT_7 (7)

/* AVR Hardware I/O Register 0x76 */
#define AVR_IO_REG_ADDR_118  (*(volatile uint8_t *)(0x20 + 118))
#define AVR_IO_REG_118_BIT_0 (0)
#define AVR_IO_REG_118_BIT_1 (1)
#define AVR_IO_REG_118_BIT_2 (2)
#define AVR_IO_REG_118_BIT_3 (3)
#define AVR_IO_REG_118_BIT_4 (4)
#define AVR_IO_REG_118_BIT_5 (5)
#define AVR_IO_REG_118_BIT_6 (6)
#define AVR_IO_REG_118_BIT_7 (7)

/* AVR Hardware I/O Register 0x77 */
#define AVR_IO_REG_ADDR_119  (*(volatile uint8_t *)(0x20 + 119))
#define AVR_IO_REG_119_BIT_0 (0)
#define AVR_IO_REG_119_BIT_1 (1)
#define AVR_IO_REG_119_BIT_2 (2)
#define AVR_IO_REG_119_BIT_3 (3)
#define AVR_IO_REG_119_BIT_4 (4)
#define AVR_IO_REG_119_BIT_5 (5)
#define AVR_IO_REG_119_BIT_6 (6)
#define AVR_IO_REG_119_BIT_7 (7)

#ifdef __cplusplus
}
#endif
#endif
